{"\"         .unknown                  = \"": 1, "\"    .headermargin   = \"": 2, "field_6_spacing": 3, "\"\\\":\"": 4, "poifs": 5, "\"        .iconic      = \"": 6, "Color": 7, "\"xf        = \"": 8, "setKul": 9, "field_28_cpnBteLvc_W6": 10, "initDocumentProperties": 11, "setShowSeriesKey": 12, "\"LittleEndian.putInt(data, \"": 13, "_fTableHeader": 14, "setHorizontal": 15, "inspectViewable": 16, "\"[/EXTENDEDFORMAT]\\n\"": 17, "legendRecord": 18, "\"    .backup          = \"": 19, "LINE_PATTERN_DASH_DOT_DOT": 20, "0x208": 21, "0x1D": 22, "field_34_ibstDispFldRMark": 23, "setAutoSize": 24, "\"EFHSSF\"": 25, "0x89": 26, "field_11_nLnnMod": 27, "0xce": 28, "ProtectionRev4Record": 29, "\"    .numstrings     = \"": 30, "UnknownPtg": 31, "field_1_value": 32, "sibling_node": 33, "0x1d9": 34, "field_49_dyaHdrBottom": 35, "\"AttrPtg\\n\"": 36, "\"Cannot return empty data\"": 37, "\"    .pnNext               = \"": 38, "\"    .fcPlcfsed            = \"": 39, "\"        .rktype     = \"": 40, "objectToObjectArray": 41, "\"grooved\"": 42, "\"testWriteSheetStyle\"": 43, "limit": 44, "0x0204": 45, "\"25\"": 46, "DocumentDescriptor": 47, "ORANGE": 48, "\"[/SeriesChartGroupIndex]\\n\"": 49, "z": 50, "\"         .oldfNoSpaceRaiseLower     = \"": 51, "LocalVariableDeclaration": 52, "71": 53, "\"illegal index: \"": 54, "\"    .fcPlcfAtnbkf         = \"": 55, "_big_block_minimum_bytes": 56, "setFDfltTrueType": 57, "setLcbPrEnvPort": 58, "\"[Series]\\n\"": 59, "getNumberOfExpressionTokens": 60, "tokenToRPN": 61, "getConstName": 62, "BarRecord": 63, "addCharacterProperties": 64, "o2": 65, "getDocinfo4": 66, "\"doc5000\"": 67, "getDisplayGuts": 68, "_dyaFromText": 69, "\"============================================\"": 70, "field_23_pnFbpPapFirst_W6": 71, "STYLE_BUILT_IN": 72, "cs": 73, "SLANTED_DASH_DOT": 74, "setVerticalAlignment": 75, "isfirstrow": 76, "stealLeft": 77, "_properties": 78, "\"/>\\r\\n\"": 79, "\"1Table\"": 80, "0x15": 81, "255": 82, "Variant": 83, "field_1_window": 84, "\"    .lcbPlgosl            = \"": 85, "\"    .width           = \"": 86, "setCpnBteChp": 87, "ProtectRecord": 88, "\"should have caught IndexOutOfBoundsException\"": 89, "getOSVersion": 90, "\"[LABELSST]\\n\"": 91, "\"Section \"": 92, "\"    .activecellrow   = \"": 93, "\".setValue(\"": 94, "\"    .numCategories        = \"": 95, "\"bar\"": 96, "getSize": 97, "field_5_brcBottom": 98, "\"3333:6666:FFFF\"": 99, "getDsf": 100, "pushExpressionToken": 101, "190": 102, "textEnd": 103, "0x26e": 104, "field": 105, "Util": 106, "getLcbPlcffndTxt": 107, "field_2_name_length": 108, "0xC0": 109, "setLastColumn": 110, "fFormNoFields": 111, "15060168": 112, "0x4f": 113, "setFcPlcflvc": 114, "getLeftCol": 115, "setDefaultRowHeightInPoints": 116, "\"    .asumyi               = \"": 117, "getFcPlcasumy": 118, "setFormat_flags1": 119, "ALIGN_RIGHT": 120, "\"[/LineFormat]\\n\"": 121, "getFSideBiSide": 122, "\"(#,##0_);[Red](#,##0)\"": 123, "field_5_formulaOfLink": 124, "getLcbSttbAutoCaption": 125, "fail": 126, "_brcBar": 127, "\"36\"": 128, "100.0f": 129, "_fDispFldRMark": 130, "getFWidowControl": 131, "displayedFiles": 132, "\"[/BOOLERR]\\n\"": 133, "bmo": 134, "\"col   = \"": 135, "\"          .borderflag= \"": 136, "\"Should have caught IOException corrupting byte \"": 137, "0xFF000000": 138, "\"    .fcSttbCaption        = \"": 139, "expected2": 140, "\"NOT An EXTSST RECORD\"": 141, "\"    .fcStshfOrig          = \"": 142, "getDyaHeight": 143, "\"0A\"": 144, "getFcSttbfglsy": 145, "ALIGN_CENTER_SELECTION": 146, "\"Unexpected exception while processing \"": 147, "\"[/DefaultDataLabelTextProperties]\\n\"": 148, "getTopColGutter": 149, "setLcbPlcfbkl": 150, "\"s2: \"": 151, "\"org.apache.poi.hssf.test\"": 152, "setFAutoHyphen": 153, "parentIndex": 154, "field_238_fcSttbListNames": 155, "isFWhichTblStm": 156, "\"REGION2 == 30,5,40,15\"": 157, "field_19_istd": 158, "1593": 159, "setHeight": 160, "testSetShortBoolean": 161, "TernaryExpression": 162, "leftCol": 163, "util": 164, "fConvMailMergeEsc": 165, "_long_buffer": 166, "FormalParameter": 167, "getDialog": 168, "setDttmCreated": 169, "booleanValue": 170, "ignore": 171, "1601": 172, "NumberFormatter": 173, "processPOIFSWriterEvent": 174, "\"    .dwHighDateTime       = \"": 175, "0x7a": 176, "getLcbPlcfspl": 177, "51": 178, "\"NOT An SST RECORD\"": 179, "BufferedReader": 180, "\"          .rghtborder= \"": 181, "\"12\"": 182, "1.23": 183, "w": 184, "\"22\"": 185, "LineFormatRecord": 186, "setPnFbpChpFirst": 187, "setPnFbpChpFirst_W6": 188, "hc": 189, "_ccolM1": 190, "sdbl": 191, "_big_block_count": 192, "getData": 193, "getKeyVirusSession30": 194, "field_1_tabids": 195, "\"18\"": 196, "PropertySetDescriptorRenderer": 197, "\"hyphenate=\\\"true\\\"\\r\\n\"": 198, "sd": 199, "field_102_fcCmds": 200, "testBufferRead": 201, "field_34_adt": 202, "isFRMPrint": 203, "testArray": 204, "\"    .tickMarkFrequency    = \"": 205, "setIss": 206, "size": 207, "_text": 208, "'\\0'": 209, "isDirectory": 210, "getLastPrinted": 211, "getKeywords": 212, "field_90_fcPlcffldFtn": 213, "\"    .borderType           = \"": 214, "ignored_exception": 215, "Literal": 216, "StyleRecord": 217, "field_8_num_selected_tabs": 218, "setFillPaletteOptions": 219, "getFcPlcfendRef": 220, "\"xvi\"": 221, "\"        .draft      = \"": 222, "\"_fubar\"": 223, "fRotateFont": 224, "field_162_fcPlcfwkb": 225, "insertValue": 226, "\"         .oldfOrigWordTableRules     = \"": 227, "\"    .dxaTab               = \"": 228, "field_2_scale": 229, "field_1_hide_obj": 230, "\"000A\"": 231, "0x226": 232, "field_2_subex_len": 233, "increment": 234, "isFConvMailMergeEsc": 235, "\"Testing org.apache.poi.hssf.usermodel.HSSFCellStyle\"": 236, "\"#,##0\"": 237, "getRightChild": 238, "\"[SAVERECALC]\\n\"": 239, "\" \"": 240, "setFPrintBodyBeforeHdr": 241, "123": 242, "DBCellRecord": 243, "getCategory": 244, "PID_CHARCOUNT": 245, "CODEPAGE": 246, "checkRows": 247, "_KEY": 248, "Iterator": 249, "PID_PAGECOUNT": 250, "\"($#,##0.00_);[Red]($#,##0.00)\"": 251, "setIndentNotParentPattern": 252, "papxOffset": 253, "\"OPTIONS & 0x10 = \"": 254, "0x00000002": 255, "0x0dbb": 256, "testZap": 257, "\"darkblue\"": 258, "0x0003": 259, "threeByteInt": 260, "_dxaPgn": 261, "\" + offset)\"": 262, "getCalcMode": 263, "main": 264, "setCharAt": 265, "0x12": 266, "\"NOT A CODEPAGE RECORD\"": 267, "field_2_delMenuCount": 268, "field_180_rgpgdbkd": 269, "getLcbPlcfbteLvc": 270, "setFcPlcfbtePapx": 271, "0x4B": 272, "field_229_ftModified": 273, "\" instead\"": 274, "field_142_fcPms": 275, "getWvkSaved": 276, "setIndent": 277, "getFontRecordAt": 278, "\"    .sheetname length= \"": 279, "uncompressProperty": 280, "setFLockRev": 281, "0xea": 282, "setDxaColumns": 283, "org": 284, "PID_KEYWORDS": 285, "0.0": 286, "setCellValue": 287, "fittopage": 288, "sbts": 289, "isInValueSection": 290, "oldName": 291, "getFillPaletteOptions": 292, "\"          .topln     = \"": 293, "\"[/HIDEOBJ]\\n\"": 294, "field_44_Spare": 295, "getNumRecords": 296, "bof": 297, "Term": 298, "setFHaveVersions": 299, "\"Not a FontIndex record\"": 300, "\"    .fcPlcftxbxBkd        = \"": 301, "field_29_cParasFtnEdn": 302, "getArabic": 303, "\"    .ccpMcr               = \"": 304, "field_3_fAutoPgn": 305, "Child": 306, "getPrintHeaders": 307, "VT_PTR": 308, "\"LittleEndian.getByteArray(data, 0x\"": 309, "\"<fo:conditional-page-master-reference odd-or-even=\\\"even\\\" \"": 310, "\"<fo:table>\"": 311, "setLcbRouteSlip": 312, "getLcbWss": 313, "setLcbSttbfAssoc": 314, "thickness": 315, "field_1_iterations": 316, "tree": 317, "fLoadOverride": 318, "\"</fo:static-content>\"": 319, "raw_blocks": 320, "field_34_lnnMin": 321, "field_182_lcbPgdMother": 322, "polished": 323, "\"PID_BYTECOUNT\"": 324, "\"checking output \"": 325, "CATEGORY_DATA_TYPE_NUMERIC": 326, "\"          .btmln     = \"": 327, "\"NOT A WRITEACCESS RECORD\"": 328, "0x276": 329, "List": 330, "ClassReference": 331, "\"          .islocked  = \"": 332, "doubleToLongBits": 333, "\"two arguments required: one input file name and one output file name\"": 334, "setCcpText": 335, "\"length check #1\"": 336, "\"    .cChWSFtnEdn          = \"": 337, "\" font records, you asked for \"": 338, "createFontTable": 339, "setLcbPlcdoaMom": 340, "setFDStrike": 341, "getSfxtText": 342, "region": 343, "\"[/1904]\\n\"": 344, "setFOnlyWinPics": 345, "field_44_dxaRight": 346, "field_9_kul": 347, "0x100": 348, "0x186": 349, "field_72_fcSttbfglsy": 350, "IntList": 351, "field_1_fontIndex": 352, "getSectionCount": 353, "row_to": 354, "setFLabelDoc": 355, "_INDEX_COUNT": 356, "\"Courier New\"": 357, "createNewFont": 358, "isFEmbedFonts": 359, "testDeleteChild": 360, "\"0x20\"": 361, "field_1_backup": 362, "\"       .paged       = \"": 363, "\"    .formatFlags          = \"": 364, "hs": 365, "retval.rows": 366, "BIG_SPOTS": 367, "setLKeyProtDoc": 368, "0x21a": 369, "LAVENDER": 370, "testGetLong": 371, "\"       .displayzeros= \"": 372, "8": 373, "setFcAutosaveSource": 374, "setLogarithmicScale": 375, "0x302": 376, "\"[DEFAULTROWHEIGHT]\\n\"": 377, "setFMapPrintTextColor": 378, "\"record took \"": 379, "oldVal": 380, "initTableStream": 381, "\"Unable to determine record types\"": 382, "locked": 383, "\"    .options        = \"": 384, "TestDocumentProperty": 385, "setDxaAbs": 386, "parseRKs": 387, "VT_CARRAY": 388, "y_old_left_child": 389, "0xee": 390, "SepxNode": 391, "\"Not a Bar record\"": 392, "getFillForeground": 393, "\"value = \"": 394, "aShort": 395, "\"dotted\"": 396, "\"[BOOLERR]\\n\"": 397, "getFcPlcfbteChpx": 398, "setKey": 399, "\"NOT A PrintHeaders RECORD\"": 400, "testGetShortValue": 401, "0x4b": 402, "getFcSttbfUssr": 403, "setLcbPlcftxbxBkd": 404, "\"Sheet3\"": 405, "\"' and use16bits= \"": 406, "\"NOT A VCenter RECORD\"": 407, "createInteger": 408, "\"Property: \\\"\"": 409, "constName": 410, "\"    .lcbSttbfAtnbkmk      = \"": 411, "processRecord": 412, "\"FIRST ROW == 25\"": 413, "\"exit create workbook from existing file function\"": 414, "_size": 415, "field_106_fcSttbfmcr": 416, "0x2fa": 417, "field_5_colourPaletteIndex": 418, "ConcurrentModificationException": 419, "field_5_indexToFontTable": 420, "_hidden": 421, "getNumColumns": 422, "NumberFormatException": 423, "TYPE_BOTTOM": 424, "0x1B": 425, "hexString": 426, "setFWhichTblStm": 427, "PLUM": 428, "testSpecial": 429, "field_5_fTableHeader": 430, "0x30": 431, "HeaderBlockConstants": 432, "\"should have thrown exception\"": 433, "0x010C": 434, "0x6a": 435, "\"8080:8080:0\"": 436, "0.0000001": 437, "\"    .fcPgdFtn             = \"": 438, "SectionProperties": 439, "VT_EMPTY": 440, "\"pt\\\" padding-top=\\\"\"": 441, "chain": 442, "_start_block": 443, "_modifications": 444, "0x123456789ABCDEF0L": 445, "\"white-space-collapse=\\\"false\\\" \"": 446, "intValue": 447, "1081384961": 448, "0xc": 449, "0x13": 450, "0xe5": 451, "\"This is a test %2.2\"": 452, "\"Should have caught BufferUnderrunException\"": 453, "\"    .charcount       = \"": 454, "0xc6": 455, "_rgistd": 456, "319": 457, "\"Encountered sheet reference\"": 458, "\"         .fMinFontSizePag          = \"": 459, "0x6C": 460, "DSFRecord": 461, "_fImprint": 462, "oldCHP": 463, "setAddMenuCount": 464, "table": 465, "alternateformula": 466, "intunipos": 467, "\"Sheet.setDimensions exiting\"": 468, "countStrings": 469, "\"    .pnFbpPapFirst_W6     = \"": 470, "getPhysicalNumberOfCells": 471, "U_DOUBLE": 472, "initFormattingProperties": 473, "getNumValues": 474, "setCellOptions": 475, "isIntMultiplication": 476, "getComponent": 477, "\"padding-end=\\\"\"": 478, "getFreezePanes": 479, "l1": 480, "regPage": 481, "rowNum": 482, "f2": 483, "isDirectoryEntry": 484, "\"0x1d\"": 485, "autoSize": 486, "recordsToMap": 487, "\"Name          = \\\"\"": 488, "setCategoryDataType": 489, "\"[/PASSWORD]\\n\"": 490, "\"Hex encoded (String): \"": 491, "\"    .displayedtab    = \"": 492, "\"    .reserved       = \"": 493, "\"\\nLast Author:         \"": 494, "\"    .colourPaletteIndex   = \"": 495, "\"testing _3.3 \"": 496, "field_224_lcbPlgosl": 497, "field_4_fOutlineDirtySave": 498, "indentLevel": 499, "getFtcAscii": 500, "\"\\nTemplate:            \"": 501, "testAddAll": 502, "getLcbPlcfendRef": 503, "\"WordDocument\"": 504, "field_10_unused1": 505, "field_56_dcs": 506, "isLastColRowRelative": 507, "e": 508, "field_5_forecolorIndex": 509, "color": 510, "\"Double Dealing Indicator\"": 511, "fForcePageSizePag": 512, "0xd": 513, "setMaxChange": 514, "\"16\"": 515, "containsValue": 516, "LINE_PATTERN_NONE": 517, "headings": 518, "level": 519, "bf_multi": 520, "setMinimumIntegerDigits": 521, "\"Checking digit for\"": 522, "field_1_footer_len": 523, "remainder": 524, "\"h:mm:ss\"": 525, "setBorder": 526, "column": 527, "0x7D": 528, "field_1_pane": 529, "VIOLET": 530, "dbval": 531, "HAIR": 532, "\"Testing org.apache.poi.poifs.storage.BATBlock\"": 533, "\"array size mismatch\"": 534, "parseLong": 535, "\"BigSSTRecord2\"": 536, "\"NOT A DELTA RECORD\"": 537, "0x16": 538, "\"byte \"": 539, "\"m/d/yy h:mm\"": 540, "\"[USESELFS]\\n\"": 541, "listCopy": 542, "shortValue": 543, "\"         .rncFtn                   = \"": 544, "0x3FFF": 545, "\"         .fTransparentMetafiles     = \"": 546, "getLong": 547, "getParCount": 548, "setLcbPlcftxbxTxt": 549, "l": 550, "getClw": 551, "isFCrypto": 552, "\"Not a valid LabelRecord\"": 553, "\"    .yPosition            = \"": 554, "setDyaFromText": 555, "unipos": 556, "field_57_lcbStshf": 557, "olevel": 558, "list1": 559, "isFVanish": 560, "356": 561, "public": 562, "_dttmDispFldRMark": 563, "\"firstcol\"": 564, "COUNT": 565, "0x00020000": 566, "field_1_borderType": 567, "\"0:FFFF:0\"": 568, "\"Other Carrier Sectors\"": 569, "getFcPrDrvr": 570, "\"\\\"$\\\"#,##0.00_);\\\\(\\\"$\\\"#,##0.00\\\\)\"": 571, "\"creating new SST via insertSST!\"": 572, "setCurrentCountry": 573, "field_10_footermargin": 574, "getLcbPlcfpgdFtn": 575, "_name_size": 576, "REFERENCE_TYPE_DIRECT": 577, "setPattern": 578, "_fill_foreground": 579, "\"    .pnLvcFirst           = \"": 580, "Utils": 581, "\"        .alternateex= \"": 582, "lfolvlOffset": 583, "getDxaAbs": 584, "testModifySimple": 585, "crdata": 586, "intBytes": 587, "\"myDir\"": 588, "\"George\"": 589, "fNoSpaceRaiseLower": 590, "0xAB": 591, "LINK_TYPE_VALUES": 592, "XSLProcessorContext": 593, "TAB": 594, "tableBodyBuffer": 595, "nocolor": 596, "displayGridlines": 597, "\"convertLabelRecords called\"": 598, "getCcolM1": 599, "field_4_height": 600, "setFRotateFont": 601, "isFRMView": 602, "setPnChpFirst": 603, "\"[GRIDSET]\\n\"": 604, "lr": 605, "getBitFieldSet": 606, "\"    .lcbSttbfRMark        = \"": 607, "0xFFFFBFFF": 608, "getCpnBteLvc": 609, "fSubsetFonts": 610, "\"\\nClass ID: \"": 611, "_dcs": 612, "getActiveCellRef": 613, "extended": 614, "block_index": 615, "getLcbPlcdoaHdr": 616, "field_67_lcbPlcfsed": 617, "field_1_axisType": 618, "\"    .lcbStwUser           = \"": 619, "\"    .lcbRouteSlip         = \"": 620, "testWrite3": 621, "createWindowProtect": 622, "country": 623, "0xfffff800": 624, "totLength": 625, "getBorderType": 626, "0xfffff400": 627, "isAllSet": 628, "Cast": 629, "'2'": 630, "\"    .currentcountry  = \"": 631, "0x3000": 632, "\"    .lcbPlcfpgdEdn        = \"": 633, "StringBuffer": 634, "0xe0": 635, "field_154_fcDggInfo": 636, "\"\\nCreate Date/Time:    \"": 637, "setIHeadingPgn": 638, "\"    .fcRouteSlip          = \"": 639, "getLeftRowGutter": 640, "\"[/SeriesLabels]\\n\"": 641, "RKRecord": 642, "CATEGORY_DATA_TYPE_SHOW_LABELS_CHARACTERISTIC": 643, "setLcbPlcfandTxt": 644, "long": 645, "\"FUD Grid Dimensions\"": 646, "\"    .cDBC                 = \"": 647, "_icoHighlight": 648, "setFSwapBordersFacingPgs": 649, "getUnused5": 650, "isShowBubbleSizes": 651, "<=": 652, "_bat_array_offset": 653, "getIndent": 654, "setFontName": 655, "0x24": 656, "propArray": 657, "getFontName": 658, "\"-----PRECONTINUED----------------------------------\"": 659, "0xB8": 660, "getAdtlPaletteOptions": 661, "MINUTE": 662, "field_74_fcPlcfglsy": 663, "DirectoryProperty": 664, "field_35_ccpFtn": 665, "\" )\\n\"": 666, "AreaRecord": 667, "SwitchStatementCase": 668, "createStyleSheet": 669, "setWTextFlow": 670, "testRecord": 671, "map": 672, "_dyaPgn": 673, "root": 674, "LOWER_LETTER": 675, "Character": 676, "\"    .dywDispPag           = \"": 677, "\"        .displayguts= \"": 678, "getFirstCol": 679, "outlineLevel": 680, "javaFieldName": 681, "getManager": 682, "\"General testbed for HSSFEventFactory based testing and \"": 683, "getExpectedChars": 684, "\" does not support mark().\"": 685, "HEADER_EVEN_INDEX": 686, "field_52_hpsZoonFontPag": 687, "_fVertical": 688, "PALETTE_SIZE": 689, "_documents": 690, "getRgdxaTab": 691, "field_1_byte_1": 692, "field_26_hpsKern": 693, "papxStart": 694, "setWMagicCreated": 695, "SQUARES": 696, "\"    .fcRgbuse             = \"": 697, "bytes": 698, "testEntrySet": 699, "Borders": 700, "\"    .lcbPrEnvPort         = \"": 701, "r_count": 702, "pathLength": 703, "infoShort": 704, "\"Label Records are supported READ ONLY...convert to LabelSST\"": 705, "ValueVariableFunctionPtg": 706, "getFcStwUser": 707, "getShortArray": 708, "value": 709, "\"    .calcmode       = \"": 710, "0x5": 711, "getOptimize": 712, "ValueRangeRecord": 713, "\"NOT A BACKUP RECORD\"": 714, "setRefreshAll": 715, "2345": 716, "isValueAxisCrossing": 717, "\"doc8\"": 718, "0x012345D4": 719, "field_6_options": 720, "rowBuffer": 721, "setNfcEdnRef1": 722, "bottomMargin": 723, "field_2_label_index": 724, "pad": 725, "0x1015": 726, "0x2001": 727, "\"text-indent=\\\"\"": 728, "\"[SeriesLabels]\\n\"": 729, "getFillForegroundColor": 730, "0xa1": 731, "setLcbPlcfpgdFtn": 732, "\"    .fcSttbfbkmk          = \"": 733, "getFcPlcftxbxTxt": 734, "setFData": 735, "\"should have caught IllegalArgumentException\"": 736, "writeSSTHeader": 737, "field_16_wMagicCreated": 738, "StringReader": 739, "setFcPlcfglsy": 740, "setFLBetween": 741, "\" in \"": 742, "attributes": 743, "field_32_sfxtText": 744, "0xC6": 745, "getTypeOffset": 746, "\"testing block at offset \"": 747, "TestHexDump": 748, "setFOnlyMacPics": 749, "testWrite2": 750, "setAdtlDiag": 751, "isFObj": 752, "\"    .col            = \"": 753, "nameOffset": 754, "pageWidth": 755, "_rotation": 756, "0x75": 757, "_tableBuffer": 758, "\"found backup record at \"": 759, "createExtendedSST": 760, "\"PID_HIDDENCOUNT\"": 761, "\"    .fcCmds               = \"": 762, "UnexpectedPropertySetTypeException": 763, "BLUE_GREY": 764, "set": 765, "assertNotNull": 766, "field_1_row": 767, "\"9\"": 768, "setFAtuoSpaceDN": 769, "\"[/MULRK]\\n\"": 770, "field_6_brcRight": 771, "GetName": 772, "TreeMap": 773, "\"    .fcPlcfendRef         = \"": 774, "isFWidowControl": 775, "setFInTable": 776, "getLcbPlcfLst": 777, "path.components": 778, "\"         .fEmbedFonts              = \"": 779, "setDzaGutter": 780, "9000": 781, "processEvents": 782, "\"    .requiredversion = \"": 783, "field_55_lcbStshfOrig": 784, "x_old_parent": 785, "0x45": 786, "getGrandParent": 787, "isFShadeFormData": 788, "36": 789, "System.out": 790, "0x190": 791, "YEAR": 792, "setDefaultCountry": 793, "row_from": 794, "toCharArray": 795, "_olstAnn": 796, "\"</fo:layout-master-set>\"": 797, "setHps": 798, "\" + offset, \"": 799, "256": 800, "0xC1": 801, "_big_block_depot": 802, "setDbcell": 803, "bstring": 804, "SS_SUB": 805, "req": 806, "add": 807, "HSSFColor.WHITE": 808, "setPcVert": 809, "\"NOT A FORMAT RECORD\"": 810, "isOldfSwapBordersFacingPgs": 811, "getVerticallyCenter": 812, "isFull": 813, "FormulaUtil": 814, "MulRKRecord": 815, "nrec": 816, "marginLeft": 817, "setDxaPgn": 818, "textStart": 819, "setFcSttbttmbd": 820, "getFormatID": 821, "\"Serializing Workbook!\"": 822, "setUnused4": 823, "getRowSumsRight": 824, "setBoolean": 825, "_iStartAt": 826, "refreshall": 827, "leastNode": 828, "getDxaLeft": 829, "testSetBoolean": 830, "getBorderLeft": 831, "\"    .fcPlcspaHdr          = \"": 832, "0x04": 833, "MutableTreeNode": 834, "\"NOT An Calc Mode RECORD\"": 835, "setBorderOptions": 836, "createRowFromRecord": 837, "getNextChild": 838, "setFLocked": 839, "setFNoSpaceRaiseLower": 840, "maxFracDigitis": 841, "field_35_wTextFlow": 842, "\"This is a test of fonts\"": 843, "testStore": 844, "field_108_fcPrDrvr": 845, "firstRow": 846, "\"?missing data?\"": 847, "numberFormat": 848, "getHeight": 849, "readFromBytes": 850, "TestDefaultDataLabelTextPropertiesRecord": 851, "\"[/MULBLANK]\\n\"": 852, "0xFCDD699A": 853, "14": 854, "badPaths": 855, "\"         .fShowBreaksInFrames      = \"": 856, "testWritingConstructor": 857, "\"    .charset         = \"": 858, "hcell": 859, "getBrcLeft": 860, "\", index \"": 861, "\"next() should have thrown an exception after a Map remove\"": 862, "\"validating byte \"": 863, "setLcbSttbfRMark": 864, "getProperty": 865, "sectionStart": 866, "\"ridge\"": 867, "d1": 868, "getCcpText": 869, "field_195_fcRouteSlip": 870, "verifyCorrect": 871, "getFlags": 872, "0x0086": 873, "0xda": 874, "0x256": 875, "field_1_formatIndex": 876, "comparator": 877, "setFormatString": 878, "\"abcdefghijklmno\"": 879, "\"[STYLE]\\n\"": 880, "lastIndexOf": 881, "\"You cannot get a boolean value from a non-boolean cell\"": 882, "setFBrLnAbove": 883, "marginBottom": 884, "testPutUncompressedUnicode": 885, "field_135_lcbPlcspaMom": 886, "setNFibBack": 887, "stshiLength": 888, "fAdjust": 889, "holder": 890, "\"text-shadow=\\\"\"": 891, "hi": 892, "fSupressTopSpacing": 893, "getIteration": 894, "field_92_fcPlcffldAtn": 895, "\"[/Axis]\\n\"": 896, "getProperties": 897, "0x93": 898, "p1": 899, "getTopBorderColor": 900, "'7'": 901, "\"BigSSTRecord2CR6\"": 902, "check": 903, "getEnvr": 904, "testNonEmptyConstructor": 905, "field_3_tickMarkFrequency": 906, "\"This is a test \\\\%1.x\"": 907, "flowName": 908, "\"    .lcbPlcffldMcr        = \"": 909, "0x2b2": 910, "getMajorIncrement": 911, "\"PID_CATEGORY\"": 912, "colFrom": 913, "getLcbPlcffldTxbx": 914, "0x4e": 915, "_top_border_palette_idx": 916, "0x1d2": 917, "setLcbPlcfpgdEdn": 918, "testLog": 919, "drilldown": 920, "field_71_lcbPlcfphe": 921, "deleteEntry": 922, "\"block[ \"": 923, "getPnFbpPapFirst_W6": 924, "getNextValueRecord": 925, "DOPAbstractType": 926, "field_31_dmOrientPage": 927, "construct": 928, "\"         .autoSeries               = \"": 929, "AXIS_TYPE_CATEGORY_OR_X_AXIS": 930, "textPieces": 931, "parPLC": 932, "run_count": 933, "testPreWrite": 934, "field_6_underline": 935, "LFO": 936, "\" bytes read\"": 937, "\"33\"": 938, "\"_(* #,##0_);_(* \\\\(#,##0\\\\);_(* \\\"-\\\"_);_(@_)\"": 939, "_hexcodes": 940, "7422": 941, "\"PID_CHARCOUNT\"": 942, "field_104_fcPlcmcr": 943, "\"[MULBLANK]\\n\"": 944, "setOldfNoTabForInd": 945, "getNfcPgn": 946, "field_13_fNoLnn": 947, "\"Integer\"": 948, "setIconic": 949, "ConstructorDeclaration": 950, "\"(#,##0.00_);[Red](#,##0.00)\"": 951, "_fPgnRestart": 952, "setHeaderLength": 953, "0x204": 954, "_diag": 955, "31": 956, "BYTE_SIZE": 957, "getFPageBreakBefore": 958, "\"POI Filesystems\"": 959, "testCaseName": 960, "remove": 961, "\"    .lcbPrDrvr            = \"": 962, "_sbat_start": 963, "opnum": 964, "afterItems": 965, "\"    .docinfo1             = \"": 966, "setPropertiesFromWorkbook": 967, "field_1_strings_per_bucket": 968, "full_count": 969, "setSheetName": 970, "ReadWriteWorkbook": 971, "_fOle2": 972, "textSize": 973, "\"/\"": 974, "0x63": 975, "field_155_lcbDggInfo": 976, "getBrcBetween": 977, "xbat_index": 978, "\"_\"": 979, "\"    .savelinkvalues  = \"": 980, "rowRecIterator": 981, "setFcPlfLfo": 982, "HSSFColor.TEAL": 983, "TestCategorySeriesAxisRecord": 984, "testExtract": 985, "\"blue\"": 986, "_pllfo": 987, "0x7b": 988, "cpi": 989, "\"NOT A valid Selection RECORD\"": 990, "setLcbSttbListNames": 991, "Throwable": 992, "testGetXBATChainOffset": 993, "\"user.name\"": 994, "finalBuffer": 995, "xf": 996, "VT_CLSID": 997, "getWrapText": 998, "field_12_ilvl": 999, "\"    .fcSttbAutoCaption    = \"": 1000, "br": 1001, "setFreezePanesNoSplit": 1002, "available": 1003, "0x1f1": 1004, "\"Deal Description\"": 1005, "_fFirstMerged": 1006, "DocumentSummaryInformation": 1007, "_seconds_1": 1008, "fData": 1009, "PID_REVNUMBER": 1010, "rgf": 1011, "setCpnBteChp_W6": 1012, "0xCF": 1013, "_previous_property_offset": 1014, "THIN_VERT_BANDS": 1015, "\"LAST ROW == 74\"": 1016, "rs": 1017, "HSSFColor.PLUM": 1018, "\"    .lcbStshfOrig         = \"": 1019, "\"/home/andy/npoi3/poi/production/testcases/net/sourceforge/poi/hssf/data\"": 1020, "omnivorousListeners": 1021, "\"          .rotation  = \"": 1022, "getLcbSttbfmcr": 1023, "\"8080:8080:8080\"": 1024, "getFamily": 1025, "field_20_dxaLeft1": 1026, "0x2E": 1027, "Collection": 1028, "_idctHint": 1029, "\"[/FontBasis]\\n\"": 1030, "getCnsPgn": 1031, "0x1a": 1032, "0xFFFFFF01": 1033, "0x000000": 1034, "0xA5": 1035, "setIndention": 1036, "_testdata": 1037, "5000": 1038, "\"Infant Discount Value\"": 1039, "\"[CONTINUE RECORD]\\n\"": 1040, "\"NOT A valid WindowTwo RECORD\"": 1041, "50": 1042, "FormulaParser": 1043, "\"         .automaticCategoryCrossing     = \"": 1044, "createTabId": 1045, "\"ExcelStringUtil.decodeExcelString(data, 0x\"": 1046, "sst": 1047, "fieldValue": 1048, "field_221_fcSttbGlsyStyle": 1049, "getDyaAbs": 1050, "\"    .iterations     = \"": 1051, "setFcBkdMother": 1052, "CatchClause": 1053, "outfile": 1054, "\"    .fcUsp                = \"": 1055, "setSubexpressionLength": 1056, "setNoColor": 1057, "\"    .Edn                  = \"": 1058, "0x4c": 1059, "\"    .footermargin   = \"": 1060, "DocumentProperty": 1061, "getDmOrientFirst": 1062, "setBAT": 1063, "\"true\"": 1064, "field_1_charCount": 1065, "\"Not a Continue Record\"": 1066, "field_167_lcbPlcftxbxTxt": 1067, "getLcbPlcfglsy": 1068, "setCWordsFtnEnd": 1069, "getLcbPlcfhdd": 1070, "populateFormats": 1071, "getCpnBteChp_W6": 1072, "getNumExFormats": 1073, "cr": 1074, "\"    .lcbPlcfbkf           = \"": 1075, "\"Should have caught ClassCastException\"": 1076, "0xD0": 1077, "\"should have caught ArrayIndexOutOfBoundsException on large index\"": 1078, "substring": 1079, "_kul": 1080, "\"    .fcDggInfo            = \"": 1081, "setCrossingPoint": 1082, "setFLayout": 1083, "getDocinfo3": 1084, "0x6b": 1085, "'4'": 1086, "\"[INDEX]\\n\"": 1087, "setFOutlineDirtySave": 1088, "getLabelFrequency": 1089, "testContains": 1090, "\"    .Edn1                 = \"": 1091, "BORDER_DASH_DOT": 1092, "LST": 1093, "small_blocks": 1094, "getListeners": 1095, "optiChoose": 1096, "getView": 1097, "getLcbPrDrvr": 1098, "setLcbSttbfbkmk": 1099, "sstrec": 1100, "\"          .readngordr= \"": 1101, "\"exit addRow\"": 1102, "\"cannot match string: \"": 1103, "getWr": 1104, "field_39_asumyi": 1105, "fExactCWords": 1106, "getVCenter": 1107, "isFBackup": 1108, "isFBold": 1109, "type": 1110, "0xf6": 1111, "_dttmRMark": 1112, "\"    .lcbSttbSavedBy       = \"": 1113, "0x162": 1114, "field_1_hcenter": 1115, "field_2_yBasis": 1116, "\"You cannot get a date value from a boolean cell\"": 1117, "FileInformationBlock": 1118, "_dxaLeft": 1119, "\"[CALCMODE]\\n\"": 1120, "_positionByte": 1121, "getLnnMin": 1122, "processProperties": 1123, "0x49": 1124, "field_149_lcbPlcfendTxt": 1125, "\"TRVA Information\"": 1126, "\"CLR D0\"": 1127, "\"difference at index \"": 1128, "getMinorIncrement": 1129, "TestBlockListImpl": 1130, "0x36e": 1131, "HSSFSheet": 1132, "getWorkbook": 1133, "findProperties": 1134, "field_31_fAutoSpaceDE": 1135, "getDyaTop": 1136, "getReserved2": 1137, "checkKey": 1138, "getFHighlight": 1139, "isFSubsetFonts": 1140, "stshSize": 1141, "\"BigSSTRecord2CR2\"": 1142, "'\u2122'": 1143, "getCpnBteLvc_W6": 1144, "\"This is a test of merging\"": 1145, "isOptimizedIf": 1146, "field_1_codepage": 1147, "getFcClx": 1148, "testReadingConstructor": 1149, "\"create labelsst row,col,index %,%,%\"": 1150, "field_105_lcbPlcmcr": 1151, "0x809": 1152, "\"    .lcbSttbFnm           = \"": 1153, "parseXFs": 1154, "CatchClauseParameter": 1155, "0x47": 1156, "isFDStrike": 1157, "_seconds_1_offset": 1158, "getContentPane": 1159, "setHResolution": 1160, "RK_INTEGER": 1161, "isFFutureSavedUndo": 1162, "rowsumsbelow": 1163, "getBooleanCellValue": 1164, "testPutDouble": 1165, "firstBlockOffset": 1166, "1997": 1167, "PID_MANAGER": 1168, "\"         .automaticMajor           = \"": 1169, "am": 1170, "setPropertyStart": 1171, "DOUBLE": 1172, "\"[/DataFormat]\\n\"": 1173, "_arabic": 1174, "getBottomBorderPaletteIdx": 1175, "setNFtn": 1176, "field3_width": 1177, "_iHeadingPgn": 1178, "command": 1179, "field_27_icoHighlight": 1180, "field_5_num_refs": 1181, "field_36_dogrid": 1182, "TestHSSFRow": 1183, "\"0x1a\"": 1184, "0x2f": 1185, "\"Testing org.apache.poi.poifs.filesystem.POIFSDocument\"": 1186, "field_37_brc": 1187, "_parent": 1188, "\"NOT A valid LabelSST RECORD\"": 1189, "str_data": 1190, "\"         .fOnlyWinPics             = \"": 1191, "\"NOT A FNGROUPCOUNT RECORD\"": 1192, "\"<fo:table-body>\"": 1193, "setNLnnMod": 1194, "0xb2": 1195, "TYPE_WORKSHEET": 1196, "lineHeights": 1197, "insertRow": 1198, "rk": 1199, "scroll": 1200, "stringid": 1201, "getIbstRMarkDel": 1202, "getFPropRMark": 1203, "setPnPapFirst": 1204, "\"0x\"": 1205, "getYBasis": 1206, "\"&#\"": 1207, "0xFE": 1208, "\"Checking property offset \"": 1209, "formulaMultiplyTwoInts": 1210, "removeRow": 1211, "0x2c": 1212, "iterator": 1213, "createFnGroupCount": 1214, "fBackward": 1215, "getWMagicCreatedPrivate": 1216, "\"</fo:page-sequence>\\r\\n\"": 1217, "field_14_dyaPgn": 1218, "field_184_lcbBkdMother": 1219, "verifyProperty": 1220, "_property_start": 1221, "\"    .h_hold          = \"": 1222, "U_NONE": 1223, "\" should not have succeeded\"": 1224, "_ftc": 1225, "HashSet": 1226, "getCellStyleAt": 1227, "firstNode": 1228, "getLastColumnRaw": 1229, "setFirstRow": 1230, "\"BIFFVIEWER REQUIRES A FILENAME***\"": 1231, "\"xi\"": 1232, "getFcSttbGlsyStyle": 1233, "12": 1234, "field_28_dyaLinePitch": 1235, "unicodesize": 1236, "\"Checking document offset \"": 1237, "0x42": 1238, "0x25": 1239, "_workbook_size": 1240, "0x26": 1241, "field_107_lcbSttbfmcr": 1242, "\"NO IDEA - NAME\"": 1243, "\"offset \"": 1244, "getHiddenCount": 1245, "getTime": 1246, "Alignment": 1247, "fRMark": 1248, "field_22_cpnBteChp_W6": 1249, "field_217_fcPlcupcRgbuse": 1250, "\"Testing org.apache.poi.poifs.property.PropertyTable\"": 1251, "setBottomBorderColor": 1252, "TestIntegerField": 1253, "optGoto": 1254, "VT_CF": 1255, "\"          .formatflag= \"": 1256, "PID_SLIDECOUNT": 1257, "testIsAllSet": 1258, "\"[/WINDOW1]\\n\"": 1259, "\"replaceValueRecord \"": 1260, "setNumSelectedTabs": 1261, "GregorianCalendar": 1262, "short": 1263, "setDocinfo1": 1264, "\"    .fcSttbfmcr           = \"": 1265, "setValuesDataType": 1266, "5L": 1267, "\"\\\"\\r\\n\"": 1268, "_fcObj": 1269, "Integer": 1270, "\"past main loop, byte \"": 1271, "charNode": 1272, "\"lastName\"": 1273, "\"[SeriesList]\\n\"": 1274, "\"    .lcbPlcspaMom         = \"": 1275, "112": 1276, "oldfNoColumnBalance": 1277, "element": 1278, "big_block_count": 1279, "_chpx": 1280, "field_2_unused2": 1281, "testProduct": 1282, "getNumBubbleValues": 1283, "fib": 1284, "draft": 1285, "\"    .lastrowadd1    = \"": 1286, "0x41e": 1287, "\"Testing org.apache.poi.hssf.record.FormulaRecord\"": 1288, "field_27_dxtCharSpace": 1289, "verifyReadingProperty": 1290, "TestSSTRecord": 1291, "findSectionHdrFtr": 1292, "0x3a": 1293, "\"red\"": 1294, "x_old_left_child": 1295, "field_21_xchSym": 1296, "getValuesDataType": 1297, "percentage": 1298, "isFVertRestart": 1299, "DOCUMENT_SUMMARY_INFORMATION_ID": 1300, "getCLines": 1301, "getTemplate": 1302, "testPutShort": 1303, "\"xl\"": 1304, "isWideChar": 1305, "setDyaRowHeight": 1306, "\"Not a LineFormat record\"": 1307, "leftover": 1308, "doRedBlackInsert": 1309, "1001": 1310, "PID_LASTAUTHOR": 1311, "field_1_rgf": 1312, "field_118_fcSttbfAssoc": 1313, "0x003C": 1314, "\"#,##0.00\"": 1315, "istd": 1316, "addCellOffset": 1317, "\" overflow=\\\"scroll\\\" region-name=\\\"\"": 1318, "setFcPlcfsed": 1319, "NONE": 1320, "freezepanes": 1321, "8.0f": 1322, "insertSST": 1323, "\"    .pnPapFirst_W6        = \"": 1324, "getFSpare0": 1325, "setPhe": 1326, "setDoptypography": 1327, "HSSFColor.VIOLET": 1328, "field_44_cpnBteChp": 1329, "field_240_fcSttbfUssr": 1330, "0x286": 1331, "\"<fo:static-content flow-name=\\\"\"": 1332, "\"Not a SeriesLabels record\"": 1333, "\"         .fSupressSpdfAfterPageBreak     = \"": 1334, "_xbat_start_offset": 1335, "isFProtEnabled": 1336, "\" lastcol  = \"": 1337, "fSpare0": 1338, "\"       .frzpnsnosplt= \"": 1339, "REPLACED": 1340, "\"Sub Deal\"": 1341, "\"          .mergecells= \"": 1342, "\"         .fAutoHyphen              = \"": 1343, "\"medium\"": 1344, "createHideObj": 1345, "getLcbUsp": 1346, "getLcbPlcffldMom": 1347, "field_9_lnc": 1348, "testGetShortRawValue": 1349, "ListTables": 1350, "\"Other Refund Text\"": 1351, "equals": 1352, "setFTransparentMetafiles": 1353, "setFEvenlySpaced": 1354, "setFormat_flags": 1355, "0x296": 1356, "GREY_25_PERCENT": 1357, "3506": 1358, "fPagHidden": 1359, "getDxaWidth": 1360, "\"Hello world\u2122\"": 1361, "DASH_DOT_DOT": 1362, "setChartGroupIndex": 1363, "isBaxcel": 1364, "\"Sales Area Code\"": 1365, "setFcPlcffldTxbx": 1366, "\"[Units]\\n\"": 1367, "RefModeRecord": 1368, "getType": 1369, "lastcell": 1370, "0x00ff": 1371, "field_4_value": 1372, "findFormatting": 1373, "java": 1374, "_sfxtText": 1375, "addDirectory": 1376, "\"[/CHARTFORMAT]\\n\"": 1377, "field_38_docinfo6": 1378, "setParentIndex": 1379, "\"PID_KEYWORDS\"": 1380, "isBoolean": 1381, "createColInfo": 1382, "Comparable": 1383, "setFC": 1384, "getLcbPlcffldHdrTxbx": 1385, "CATEGORY_DATA_TYPE_ALL_TEXT_CHARACTERISTIC": 1386, "nextIndex": 1387, "getPnChpFirst_W6": 1388, "nextLFO": 1389, "Token": 1390, "outputArray": 1391, "mask": 1392, "\"    .lastrow        = \"": 1393, "createDirectory": 1394, "shiftLeft": 1395, "System": 1396, "setLcbPlcmcr": 1397, "_string_data_offset": 1398, "\"    .name_length     = \"": 1399, "currentNode": 1400, "msg": 1401, "setMode": 1402, "setFSaveFormData": 1403, "\"trying block count of \"": 1404, "setName": 1405, "setFVirusPrompted": 1406, "setDxaFromText": 1407, "field_1_crossingPoint": 1408, "getLProductRevised": 1409, "\"    .fcPlcfLst            = \"": 1410, "\"[/PRECISION]\\n\"": 1411, "getNoColor": 1412, "_vertical_alignment": 1413, "SelectionRecord": 1414, "\"    .fitheight      = \"": 1415, "0x01C0": 1416, "\"         .fPMHMainDoc              = \"": 1417, "INFO": 1418, "0x1017": 1419, "createPap": 1420, "to_be_written": 1421, "\"    .fcIslandFirst        = \"": 1422, "doRedBlackDeleteFixup": 1423, "setSelectedTab": 1424, "\"FFFF:9999:CCCC\"": 1425, "obj": 1426, "\"[PASSWORD]\\n\"": 1427, "\"[SheetProperties]\\n\"": 1428, "setNrOfBytes": 1429, "\"[WINDOWPROTECT]\\n\"": 1430, "before": 1431, "isLabelAsPercentage": 1432, "\"    .unicodeflag     = \"": 1433, "setLcbFormFldSttbs": 1434, "setFcSttbGlsyStyle": 1435, "0x44": 1436, "0x1060": 1437, "fixAfterDeletion": 1438, "arraySize": 1439, "isCustomNumberFormat": 1440, "_next": 1441, "setCompressedUnicodeFlag": 1442, "setRgpgdbkd": 1443, "field_1_chartGroupIndex": 1444, "setBubbleSeriesType": 1445, "0xB7": 1446, "0x0000FFFFL": 1447, "getNRevision": 1448, "setDwLowDateTime": 1449, "setWMagicRevised": 1450, "\"reading \"": 1451, "processComplexFile": 1452, "getNumMergedRegions": 1453, "getLastCellNum": 1454, "_fPrev": 1455, "setFcSttbListNames": 1456, "Cloneable": 1457, "removeProperty": 1458, "\"testing cat org.apache.poi.hdf.*:INFO\"": 1459, "\"testWriteSheetMerged\"": 1460, "setFillPattern": 1461, "150": 1462, "\"19\"": 1463, "setFOutline": 1464, "initialComponents": 1465, "\"    .axisType             = \"": 1466, "lineWidth": 1467, "\"    .lcbPlcpad            = \"": 1468, "getIco": 1469, "setAlternativeExpression": 1470, "field_192_lcbBkdEdn": 1471, "\"[FontIndex]\\n\"": 1472, "getLcbPlcmcr": 1473, "0x18": 1474, "'d'": 1475, "\"getNextValue loc= \"": 1476, "'r'": 1477, "fDStrike": 1478, "getColWidth": 1479, "0x7c": 1480, "\"35\"": 1481, "setOptimize": 1482, "PN": 1483, "eof": 1484, "setIndexCode": 1485, "setWMagicRevisedPrivate": 1486, "setFcPlcfandRef": 1487, "\"SetEquality 3\"": 1488, "\"f\"": 1489, "\"a2\"": 1490, "chpxOffset": 1491, "cellNum": 1492, "\"firstrow\"": 1493, "_loggers": 1494, "getWSBool2": 1495, "isFIncludeHeader": 1496, "0x02FFFFFF": 1497, "_fBackward": 1498, "getKey": 1499, "3.0": 1500, "dstOffset": 1501, "0x0082": 1502, "\"Testing org.apache.poi.poifs.storage.BlockAllocationTableReader\"": 1503, "setLcbPlcocx": 1504, "field_32_lProductCreated": 1505, "THICK_FORWARD_DIAG": 1506, "setFcBkdEdn": 1507, "SeriesChartGroupIndexRecord": 1508, "\"[BACKUP]\\n\"": 1509, "hssfworkbook": 1510, "getCPg": 1511, "\"xxxviii\"": 1512, "reset": 1513, "getLcbStshf": 1514, "\"    .referenceType        = \"": 1515, "\"    .hpsZoonFontPag       = \"": 1516, "setFTruncDxaExpand": 1517, "parentPAP": 1518, "getCcpAtn": 1519, "ALIGN_JUSTIFY": 1520, "field_13_dxaPgn": 1521, "DocumentOutputStream": 1522, "\"removing item \"": 1523, "\"[RK]\\n\"": 1524, "fsName": 1525, "getFontIndex": 1526, "setIterations": 1527, "setRowNum": 1528, "writeToBytes": 1529, "rowTo": 1530, "0x1020": 1531, "setHidden": 1532, "0x3b": 1533, "setVerticalScale": 1534, "numChp": 1535, "\"    .maximumAxisValue     = \"": 1536, "field_6_reserved": 1537, "pop": 1538, "\"input = \"": 1539, "0x2c6": 1540, "recordBytes": 1541, "\"[/NumberFormatIndex]\\n\"": 1542, "_border_right": 1543, "setLcbPlcfbteLvc": 1544, "stringbyteswritten": 1545, "\"0:0:0\"": 1546, "getAlignmentOptions": 1547, "setInputFile": 1548, "xbats": 1549, "getStartBlock": 1550, "\"($#,##0_);($#,##0)\"": 1551, "getCategoryAxisCross": 1552, "getFcBkdFtn": 1553, "SkipWhite": 1554, "_dyaHdrBottom": 1555, "setLcbSttbfglsy": 1556, "_fFacingPages": 1557, "\">\"": 1558, "field_3_reserved2": 1559, "field_115_lcbWss": 1560, "\"[/PRINTSETUP]\\n\"": 1561, "getStreamPos": 1562, "72": 1563, "field_7_nFibBack": 1564, "code": 1565, "setLcbSttbfUssr": 1566, "0x00FF": 1567, "path": 1568, "getBackcolorIndex": 1569, "frec": 1570, "0x8000": 1571, "setLcbPlcfAtnbkf": 1572, "getPropertyStart": 1573, "\"\\nLast Save Date/Time: \"": 1574, "0x336": 1575, "field_1_wIdent": 1576, "setInvert": 1577, "fFutureSavedUndo": 1578, "HSSFColor.AQUA": 1579, "\"NOT A MERGEDCELLS RECORD!! \"": 1580, "\"o\"": 1581, "setDyaBefore": 1582, "EXPERIMENTAL_FORMULA_SUPPORT_ENABLED": 1583, "setBrcRight": 1584, "usesUnicode": 1585, "\"         .fHyphCapitals            = \"": 1586, "newval": 1587, "findRenderer": 1588, "checkNonNullComparable": 1589, "&&": 1590, "setFcPlgosl": 1591, "SuperMethodInvocation": 1592, "\"         .zkSaved                  = \"": 1593, "LabelRecord": 1594, "\"Testing util.StringUtil functionality\"": 1595, "\"[/VCENTER]\\n\"": 1596, "fCrypto": 1597, "testAdd": 1598, "addListParagraphContent": 1599, "\"\\nLast Printed:        \"": 1600, "\"[/BOUNDSHEET]\\n\"": 1601, "0x33": 1602, "getRotation": 1603, "\"    .fcPlcfpgdFtn         = \"": 1604, "isRoot": 1605, "isFLinkStyles": 1606, "CategorySeriesAxisRecord": 1607, "field_26_pnFbpLvcFirst_W6": 1608, "setPropertiesFromSheet": 1609, "getSeriesNumbers": 1610, "\"] mismatch\"": 1611, "0x1C": 1612, "setCrossCategoryAxisAtMaximum": 1613, "end": 1614, "getParentIndex": 1615, "0x6e": 1616, "\"xxxix\"": 1617, "field_2_row_active_cell": 1618, "second": 1619, "\"NO IDEA YET VALUE VARIABLE\"": 1620, "arraycopy": 1621, "setXchSym": 1622, "\"[HEADER]\\n\"": 1623, "useTable1": 1624, "getHps": 1625, "getLcbPlcspaHdr": 1626, "\"Consolidated B-24J Liberator The Dragon & His Tai\"": 1627, "HISTORY_MASK": 1628, "protected": 1629, "parentType": 1630, "\"_(\\\"$\\\"* #,##0.00_);_(\\\"$\\\"* \\\\(#,##0.00\\\\);_(\\\"$\\\"* \\\"-\\\"??_);_(@_)\"": 1631, "field_33_pgnStart": 1632, "field_30_clw": 1633, "\"t\"": 1634, "\"3333:3333:9999\"": 1635, "field_3_color_palette_index": 1636, "\"-page\"": 1637, "\"after\"": 1638, "removeValueRecord": 1639, "\"    .fcPlcfandTxt         = \"": 1640, "field_62_dttmPropRMark": 1641, "VT_BLOB": 1642, "max_entries_per_block": 1643, "\", size =\"": 1644, "getDisplayedTab": 1645, "0x16a": 1646, "registryClosed": 1647, "\"[INTERFACEEND]\\n\"": 1648, "sectionFormatID": 1649, "setDyaAbs": 1650, "564": 1651, "\"firstColRowRel= \"": 1652, "PlotGrowthRecord": 1653, "field_28_cPgFtnEdn": 1654, "getVertAlign": 1655, "0x2e2": 1656, "isMacshadowed": 1657, "getHeadingPair": 1658, "field_209_fcDocUndo": 1659, "first": 1660, "\" bytes)\"": 1661, "VT_STORAGE": 1662, "PID_PARCOUNT": 1663, "setFirstColumnRaw": 1664, "\"PID_TEMPLATE\"": 1665, "0x9": 1666, "tabs": 1667, "numArgs": 1668, "field_5_fPageBreakBefore": 1669, "\"         .fLinkStyles              = \"": 1670, "setFamily": 1671, "parPlcSize": 1672, "getXPosition": 1673, "_override": 1674, "processContinue": 1675, "isHorizontal": 1676, "_testdata_size": 1677, "getYPosition": 1678, "_fpc": 1679, "\"          .diaglnstyl= \"": 1680, "getNameLength": 1681, "getAdt": 1682, "192": 1683, "field_6_cnsPgn": 1684, "\"<fo:table-header>\"": 1685, "fillDecoder": 1686, "\"    .fcPrEnvPort          = \"": 1687, "char_count": 1688, "setDisplayRowColHeadings": 1689, "raw_data_array": 1690, "101": 1691, "getID": 1692, "\"PID_COMMENTS\"": 1693, "changeName": 1694, "Comparator": 1695, "\"x\"": 1696, "0x8": 1697, "_fcPic": 1698, "_docProps": 1699, "fHtmlDoc": 1700, "BORDER_DASH_DOT_DOT": 1701, "iterate": 1702, "backupRecord": 1703, "doNotSizeWithWindow": 1704, "\"<fo:root xmlns:fo=\\\"http://www.w3.org/1999/XSL/Format\\\">\\r\\n\"": 1705, "\"[HIDEOBJ]\\n\"": 1706, "_roman": 1707, "ALIGN_CENTER": 1708, "getPnFbpLvcFirst": 1709, "field_3_numCategories": 1710, "\"[/RK]\\n\"": 1711, "setDisplayTabs": 1712, "PasswordRecord": 1713, "LocalProperty": 1714, "off": 1715, "getDogrid": 1716, "\"    .fcBkdEdn             = \"": 1717, "\"52\"": 1718, "\"Testing org.apache.poi.poifs.storage.HeaderBlockReader\"": 1719, "ms_since_19700101": 1720, "\" size = \"": 1721, "fSaveFormData": 1722, "setPgbProb": 1723, "\"[PRECISION]\\n\"": 1724, "getPresentationFormat": 1725, "k": 1726, "16998": 1727, "HSSFColor.GREY_50_PERCENT": 1728, "\"[/FIB]\\n\"": 1729, "out_data": 1730, "getCParasFtnEdn": 1731, "setWAlignFont": 1732, "\"name\"": 1733, "isLocked": 1734, "\"getXF=\"": 1735, "setDyaHdrBottom": 1736, "0x15a": 1737, "\"[LinkedData]\\n\"": 1738, "blockSizes": 1739, "setValue": 1740, "setClm": 1741, "30474216": 1742, "getLKeyProtDoc": 1743, "\"         .autoSize                 = \"": 1744, "setFWCFtnEdn": 1745, "field_7_expression_len": 1746, "getRowFrom": 1747, "\"PID_APPNAME\"": 1748, "38": 1749, "45568": 1750, "getVaryDisplayPattern": 1751, "\"    .fcSttbfglsy          = \"": 1752, "setLcbBkdFtn": 1753, "getFcDggInfo": 1754, "MarkUnsupportedException": 1755, "FooterRecord": 1756, "isStacked": 1757, "FormatRecord": 1758, "excess_block_array": 1759, "0x4F": 1760, "oddHeader": 1761, "getDefaultCountry": 1762, "field_236_fcPlcfgram": 1763, "\"0.00%\"": 1764, "HSSFRow": 1765, "field_11_brcl": 1766, "XF_STYLE": 1767, "\"         .automaticMinimum         = \"": 1768, "getTabWidthRatio": 1769, "bool2": 1770, "u": 1771, "field_1_linkType": 1772, "0x19b": 1773, "setLcbSttbGlsyStyle": 1774, "getJavaDate": 1775, "\"row       = \"": 1776, "field_34_fVertical": 1777, "\"        .outlinelvl = \"": 1778, "paragraphs": 1779, "0x14a": 1780, "_rgbxchNums": 1781, "field_17_fWidowControl": 1782, "testRead": 1783, "\"    .zero            = \"": 1784, "getRgpgdbkd": 1785, "field_116_fcDop": 1786, "testSetSBATStart": 1787, "HSSFColor.GREY_25_PERCENT": 1788, "HSSFColor.GOLD": 1789, "field_66_rgtbd": 1790, "tablename": 1791, "partiallyRead": 1792, "BlockListImpl": 1793, "\"SUM(\"": 1794, "testEquals": 1795, "setSpacing": 1796, "0L": 1797, "getPaperSize": 1798, "0x1f3": 1799, "CELL_TYPE_NUMERIC": 1800, "\"Not a ValueRange record\"": 1801, "\"lastCol  = \"": 1802, "getSSTString": 1803, "\"Remarks\"": 1804, "isAutoPosX": 1805, "params": 1806, "VT_LPWSTR": 1807, "\"Testing org.apache.poi.poifs.property.PropertyFactory\"": 1808, "getOutlineLevel": 1809, "ADD": 1810, "isFLockRev": 1811, "_indent_not_parent_alignment": 1812, "oppositeIndex": 1813, "PID_TITLE": 1814, "setBrcp": 1815, "testGetKeyForValue": 1816, "\"          .celloption= \"": 1817, "\"    .defaultcountry  = \"": 1818, "drawTicks": 1819, "byte": 1820, "\"    .lcbFormFldSttbs      = \"": 1821, "bigBlocks": 1822, "field_129_lcbSttbfAtnbkmk": 1823, "\"test\"": 1824, "field_11_hpsPos": 1825, "endFC": 1826, "\"         .fVirusPrompted           = \"": 1827, "getDisplayHorizontalScrollbar": 1828, "WhileStatement": 1829, "getRawValue": 1830, "\"second attempt should have failed\"": 1831, "verifyChildren": 1832, "getEpc": 1833, "record_type": 1834, "0x0007": 1835, "setAnld": 1836, "_ibstRMarkDel": 1837, "0x252": 1838, "0x1e5": 1839, "doGet": 1840, "setNormalZoom": 1841, "getJc": 1842, "\"cyan\"": 1843, "\"[REFMODE]\\n\"": 1844, "_sst_record_overhead": 1845, "\"    .lcbSttbCaption       = \"": 1846, "findPAPProperties": 1847, "\"_(*#,##0_);_(*(#,##0);_(* \\\"-\\\"_);_(@_)\"": 1848, "\"         .vert                     = \"": 1849, "getDebugInfo": 1850, "\"[/AxisUsed]\\n\"": 1851, "0x1b6": 1852, "getFcSttbfIntlFld": 1853, "\"length check #3\"": 1854, "\"    .fcSttbfffn           = \"": 1855, "HSSFColor.OLIVE_GREEN": 1856, "toHexString": 1857, "serialize": 1858, "block_array": 1859, "10": 1860, "CATEGORY_DATA_TYPE_VALUE_AND_PERCENTAGE_CHARACTERISTIC": 1861, "isAutomaticMinimum": 1862, "getBorderOptions": 1863, "POIFSWriterEvent": 1864, "getShd": 1865, "\"abcdefghijklmnop\"": 1866, "field_1_num_strings": 1867, "isFVirusLoadSafe": 1868, "setFShowBreaksInFrames": 1869, "\"\\\"\"": 1870, "_indent_not_parent_cell_options": 1871, "_dzaGutter": 1872, "setFFormNoFields": 1873, "TestDirectoryProperty": 1874, "\"    .formatindex     = \"": 1875, "convert": 1876, "setGridset": 1877, "_next_property_offset": 1878, "\"break-before=\\\"page\\\"\\r\\n\"": 1879, "0x1024": 1880, "\"    .nProduct             = \"": 1881, "getLinkType": 1882, "isUnused4": 1883, "fontTableIndex": 1884, "\"New sheet named: \"": 1885, "setFDispFldRMark": 1886, "\"firstcol  = \"": 1887, "TestSmallBlockTableWriter": 1888, "0x1ed": 1889, "0x2": 1890, "isIGutterPos": 1891, "setBrcBottom": 1892, "HIDE_ALL": 1893, "fSuppressTopSPacingMac5": 1894, "ltor": 1895, "\"    .lKey                 = \"": 1896, "\"font-weight=\\\"bold\\\" \"": 1897, "field_3_left_col": 1898, "\"NOT A valid RK RECORD\"": 1899, "\"         .wvkSaved                 = \"": 1900, "getRKNumber": 1901, "0x10": 1902, "setBrcTop": 1903, "\"34\"": 1904, "field_80_fcPlcfbtePapx": 1905, "field_19_dxaLeft": 1906, "event": 1907, "createWindowOne": 1908, "fDot": 1909, "setFTitlePage": 1910, "instanceof": 1911, "field_136_fcPlcspaHdr": 1912, "setLocked": 1913, "_good_array": 1914, "0x201": 1915, "isFFormNoFields": 1916, "field_9_tab_width_ratio": 1917, "name": 1918, "growArray": 1919, "\"correct small block count: \"": 1920, "getDefaultRowHeight": 1921, "\"Infant Discount Permitted\"": 1922, "setCChWSFtnEdn": 1923, "DO_NOT_REPLACE": 1924, "getFKinsoku": 1925, "JANUARY": 1926, "\"    .type            = \"": 1927, "0x0104": 1928, "getAdtlDiag": 1929, "field_2_cell_offsets": 1930, "header_block_reader": 1931, "testAddChild": 1932, "setIbstRMarkDel": 1933, "_ilfo": 1934, "sbat": 1935, "\"         .fWord97Saved             = \"": 1936, "\"Not a SeriesList record\"": 1937, "field_1_vcenter": 1938, "getLcbPgdEdn": 1939, "isEqual": 1940, "field_3_page_start": 1941, "border": 1942, "TAP": 1943, "\"optchos=\"": 1944, "setShowsRootHandles": 1945, "\"37\"": 1946, "TestShortField": 1947, "getIndentionOptions": 1948, "2049": 1949, "constructor": 1950, "_NODE_RED": 1951, "\"checking correct output size: \"": 1952, "\"should have thrown an exception\"": 1953, "setWSpare2": 1954, "getFieldName": 1955, "\"    .valuesDataType       = \"": 1956, "\"13\"": 1957, "HSSFColor.SKY_BLUE": 1958, "unistr": 1959, "\"    .fcSttbfIntlFld       = \"": 1960, "getPnLvcFirst": 1961, "\"xlv\"": 1962, "_hpsKern": 1963, "getIcoHighlight": 1964, "_hashcode": 1965, "setDelMenuCount": 1966, "\"p\"": 1967, "DARK_BLUE": 1968, "_chYsr": 1969, "setLcbPlcfsea": 1970, "field_15_fLBetween": 1971, "\"0:3333:0\"": 1972, "setJc": 1973, "_fcEnd": 1974, "testFullPathConstructor": 1975, "field_5_unicode_flag": 1976, "\"Workbook\"": 1977, "setIndentionOptions": 1978, "h": 1979, "setColumnWidth": 1980, "setPtap": 1981, "_bottom_border_palette_idx": 1982, "setFont": 1983, "\"start-indent=\\\"\"": 1984, "getFormulaOfLink": 1985, "\"in \"": 1986, "field_4_fit_width": 1987, "\"Serializing Workbook with offsets\"": 1988, "\"    .categorySpace        = \"": 1989, "setFcSttbSavedBy": 1990, "\"    .heightBasis          = \"": 1991, "lenmatchin": 1992, "\"</fo:table-body>\"": 1993, "isOptimizedChoose": 1994, "\"sheet createSheet (existing file) exited\"": 1995, "setFooterMargin": 1996, "setUp": 1997, "setCrossesFarRight": 1998, "\"    .cpnBteChp_W6         = \"": 1999, "getFBrLnAbove": 2000, "BUILD_YEAR": 2001, "setCpnBtePap": 2002, "0x266": 2003, "c2": 2004, "field_6_backcolorIndex": 2005, "epc": 2006, "field_143_lcbPms": 2007, "getDataFormat": 2008, "_brcBottom1": 2009, "rectypes": 2010, "\"This is a % test %.3\"": 2011, "\"3333:CCCC:CCCC\"": 2012, "newrec": 2013, "\"collast        = \"": 2014, "\"    .docinfo6             = \"": 2015, "getSid": 2016, "field_37_fInTable": 2017, "VERTICAL_TOP": 2018, "0x282": 2019, "getCpnBtePap_W6": 2020, "getDxaPgn": 2021, "setFcPlcfhdrtxbxTxt": 2022, "getCellOptions": 2023, "\"    .lcbSttbfffn          = \"": 2024, "\"Deal Information\"": 2025, "0xAF": 2026, "\"         .fHtmlDoc                 = \"": 2027, "\"    .fcPlcflvc            = \"": 2028, "getFcCmds": 2029, "IllegalArgumentException": 2030, "0xd608": 2031, "\"    .column         = \"": 2032, "getFcPlcfpgdEdn": 2033, "setLcbSttbfmcr": 2034, "_blocks_per_big_block": 2035, "\"         .macoutlined= \"": 2036, "\"firstCol = \"": 2037, "0x292": 2038, "\"    .lcbPlcftxbxBkd       = \"": 2039, "80": 2040, "isFNoColumnBalance": 2041, "_clm": 2042, "0x13d": 2043, "\"    .inforecord     = \"": 2044, "\", value)\"": 2045, "0xffff8014": 2046, "\"Testing 